## Plan Result (sandbox-enterprise)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 24 to add, 0 to change, 24 to destroy.</code></pre>

* Replace
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;CFT - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;CFT-NonProd - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;CFT-Prod - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;CFT-Sandbox - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;Crime - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;HMCTS - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;Heritage - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;Heritage-NonProd - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;Heritage-Prod - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;Heritage-Sandbox - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;Platform - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;Platform-NonProd - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;Platform-Prod - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;Platform-Sandbox - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;SDS - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;SDS-NonProd - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;SDS-Prod - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;SDS-Sandbox - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;Security - Application Gateway Backend Health Reader&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.subscription["DTS-RBAC-NONPRODUCTION"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/06069648-d13b-4c3c-9367-f3a1ed8e38bc/providers/Microsoft.Authorization/roleAssignments/8732fba8-f0e8-1df2-9fe6-317514e2b8da" -> (known after apply)
      ~ name                             = "8732fba8-f0e8-1df2-9fe6-317514e2b8da" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/06069648-d13b-4c3c-9367-f3a1ed8e38bc/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DTS-RBAC-SBOX"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/efd1f812-596d-4175-9e19-5b0577156ff9/providers/Microsoft.Authorization/roleAssignments/d5a5c110-a681-b563-3de3-b3e41d01e725" -> (known after apply)
      ~ name                             = "d5a5c110-a681-b563-3de3-b3e41d01e725" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/efd1f812-596d-4175-9e19-5b0577156ff9/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DTS-Terraform-Dev-Test3"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/6d1e076a-5d02-4920-9fba-04063e28a488/providers/Microsoft.Authorization/roleAssignments/0f3631aa-2219-594f-0b84-af9bbad9a470" -> (known after apply)
      ~ name                             = "0f3631aa-2219-594f-0b84-af9bbad9a470" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/6d1e076a-5d02-4920-9fba-04063e28a488/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DTS-Terraform-Dev-Test4"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/173a0e96-4482-4859-ac93-79e4abc83ab0/providers/Microsoft.Authorization/roleAssignments/7028d9d9-8466-f61b-738a-d15373e30b61" -> (known after apply)
      ~ name                             = "7028d9d9-8466-f61b-738a-d15373e30b61" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/173a0e96-4482-4859-ac93-79e4abc83ab0/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/bb9ca405-3217-4c84-9780-cdfab539e8b3/providers/Microsoft.Authorization/roleAssignments/b8ee33b3-eed2-6a33-1a2f-b801d45fe1c1" -> (known after apply)
      ~ name                             = "b8ee33b3-eed2-6a33-1a2f-b801d45fe1c1" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/bb9ca405-3217-4c84-9780-cdfab539e8b3/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["CFT - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/CFT/providers/Microsoft.Authorization/roleAssignments/4daf0fc2-aae8-322a-c42a-6a0c959db1ac" -> (known after apply)
      ~ name                             = "4daf0fc2-aae8-322a-c42a-6a0c959db1ac" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["CFT-NonProd - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/CFT-NonProd/providers/Microsoft.Authorization/roleAssignments/c7e4ad83-bfdd-8d39-9b81-51c364e34539" -> (known after apply)
      ~ name                             = "c7e4ad83-bfdd-8d39-9b81-51c364e34539" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["CFT-Prod - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/CFT-Prod/providers/Microsoft.Authorization/roleAssignments/d4627268-6814-a681-1798-16b1e1b77790" -> (known after apply)
      ~ name                             = "d4627268-6814-a681-1798-16b1e1b77790" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["CFT-Sandbox - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/CFT-Sandbox/providers/Microsoft.Authorization/roleAssignments/6f959e5b-580a-4e04-49db-c89dadc62099" -> (known after apply)
      ~ name                             = "6f959e5b-580a-4e04-49db-c89dadc62099" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["Crime - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/Crime/providers/Microsoft.Authorization/roleAssignments/ddeaddba-b4d6-5fcb-21ca-d56b84f97cc0" -> (known after apply)
      ~ name                             = "ddeaddba-b4d6-5fcb-21ca-d56b84f97cc0" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["HMCTS - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/HMCTS/providers/Microsoft.Authorization/roleAssignments/9847a254-c9ea-75dc-1765-1795279fea5b" -> (known after apply)
      ~ name                             = "9847a254-c9ea-75dc-1765-1795279fea5b" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["Heritage - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/Heritage/providers/Microsoft.Authorization/roleAssignments/53960e7b-88e7-c508-b7de-c5858cbb6220" -> (known after apply)
      ~ name                             = "53960e7b-88e7-c508-b7de-c5858cbb6220" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["Heritage-NonProd - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/Heritage-NonProd/providers/Microsoft.Authorization/roleAssignments/7ef05d9f-1610-eae3-94f8-8148893c51e9" -> (known after apply)
      ~ name                             = "7ef05d9f-1610-eae3-94f8-8148893c51e9" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["Heritage-Prod - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/Heritage-Prod/providers/Microsoft.Authorization/roleAssignments/fb4543fd-6a20-15d9-44ae-9d5c0cd62944" -> (known after apply)
      ~ name                             = "fb4543fd-6a20-15d9-44ae-9d5c0cd62944" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["Heritage-Sandbox - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/Heritage-Sandbox/providers/Microsoft.Authorization/roleAssignments/a5627505-e5da-94a4-0909-9aff6ab36016" -> (known after apply)
      ~ name                             = "a5627505-e5da-94a4-0909-9aff6ab36016" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["Platform - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/Platform/providers/Microsoft.Authorization/roleAssignments/afd06d28-1bb4-5f32-f5c3-8942107e4327" -> (known after apply)
      ~ name                             = "afd06d28-1bb4-5f32-f5c3-8942107e4327" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["Platform-NonProd - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/Platform-NonProd/providers/Microsoft.Authorization/roleAssignments/ee13e7fe-71cf-d200-1b38-741629c3e0be" -> (known after apply)
      ~ name                             = "ee13e7fe-71cf-d200-1b38-741629c3e0be" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["Platform-Prod - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/Platform-Prod/providers/Microsoft.Authorization/roleAssignments/f30d3ff9-a456-8e46-9c8e-e29edc322176" -> (known after apply)
      ~ name                             = "f30d3ff9-a456-8e46-9c8e-e29edc322176" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["Platform-Sandbox - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/Platform-Sandbox/providers/Microsoft.Authorization/roleAssignments/b7aebeba-5dd0-afe2-9ba4-857067e11aaf" -> (known after apply)
      ~ name                             = "b7aebeba-5dd0-afe2-9ba4-857067e11aaf" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["SDS - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/SDS/providers/Microsoft.Authorization/roleAssignments/fd51b6bd-b309-e3b7-7784-3811bdfdec13" -> (known after apply)
      ~ name                             = "fd51b6bd-b309-e3b7-7784-3811bdfdec13" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["SDS-NonProd - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/SDS-NonProd/providers/Microsoft.Authorization/roleAssignments/86b919ac-ac5f-7c5e-4933-2106dc82529f" -> (known after apply)
      ~ name                             = "86b919ac-ac5f-7c5e-4933-2106dc82529f" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["SDS-Prod - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/SDS-Prod/providers/Microsoft.Authorization/roleAssignments/d3d27fdc-dd9f-ab93-fa15-2780ecda15d0" -> (known after apply)
      ~ name                             = "d3d27fdc-dd9f-ab93-fa15-2780ecda15d0" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["SDS-Sandbox - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/SDS-Sandbox/providers/Microsoft.Authorization/roleAssignments/6cb6f8c0-da74-9d79-266e-9e2d86ef1ed1" -> (known after apply)
      ~ name                             = "6cb6f8c0-da74-9d79-266e-9e2d86ef1ed1" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["Security - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/Security/providers/Microsoft.Authorization/roleAssignments/84eaf100-609c-a45d-86c1-968a0f2b83bc" -> (known after apply)
      ~ name                             = "84eaf100-609c-a45d-86c1-968a0f2b83bc" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> "f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 24 to add, 0 to change, 24 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":79,"Program":"tfcmt","SHA1":"","Target":"sandbox-enterprise","Vars":{}} -->